# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 with MSDAF (Multi-Scale Dual-Attention Fusion Module)
# MSDAF replaces FCM modules for enhanced small object detection
# Beta = 0.75 (75% channel attention, 25% spatial attention)

# Parameters
nc: 4 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8 backbone with MSDAF (beta=0.75)
backbone:
  - [-1, 1, Conv, [64, 3, 2]] # 0-p1/2 320×320×64
  - [-1, 1, Conv, [128, 3, 2]] # 1-p2/4 160×160×128
  - [-1, 1, MSDAF, [128, 0.75]] # 2 - Replace FCM_3 with MSDAF (beta=0.75)
  - [-1, 1, Down, [256]] # 3-p3/8 80×80×256
  - [-1, 1, MSDAF, [256, 0.75]] # 4 - Replace FCM_2 with MSDAF (beta=0.75)
  - [-1, 1, Down, [512]] # 5-p4/16 40×40×512
  - [-1, 1, MSDAF, [512, 0.75]] # 6 - Replace FCM_1 with MSDAF (beta=0.75)
  - [-1, 1, Pzconv, [512]] # 7-p4/16 40×40×512
  - [-1, 1, MSDAF, [512, 0.75]] # 8 - Replace FCM with MSDAF (beta=0.75)
  - [-1, 1, SPPF, [512, 5]] # 9 40×40×512

# YOLOv8 head (unchanged)
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 10 80×80×512
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3 80×80×(512+256) -> 80×80×768
  - [-1, 3, C2f, [256]] # 12 (p3/8) 80×80×256

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] # 13 160×160×256
  - [[-1, 2], 1, Concat, [1]] # cat backbone P2 160×160×(256+128) -> 160×160×384
  - [-1, 3, C2f, [128]] # 15 (P2/4) 160×160×128

  - [-1, 1, Down, [256]] # 16 80×80×256
  - [[-1, 12], 1, Concat, [1]] # 17 cat head P3 80×80×(256+256) -> 80×80×512
  - [-1, 3, C2f, [256]] # 18 (P3/8) 80×80×256

  - [-1, 1, Down, [512]] # 19 40×40×512
  - [[-1, 9], 1, Concat, [1]] # cat head P4 40×40×(512+512) -> 40×40×1024
  - [-1, 3, C2f, [512]] # 21 (P4/16) 40×40×512

  - [[18, 21], 1, Detect, [nc]] # Detect(p3, p4)

